// pages/templet/templet.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    btns: ["调查", "任务", "通知", "打卡", "祝福"],
    ops: ["日常提醒", "开学返校", "接送通知", "放假离校"],
    ops1: ["安全嘱咐", "安全须知", "心理健康", "雷雨大风"],
    ops2: ["假期活动", "国庆节", "春秋游", "夏冬令营"]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})